[{"title":"Developer Week in Social Media","description":"","time_and_track":[""],"speaker":""},{"title":"Morgens im Stand-Up","description":"Was haben wir gemacht? Was kommt als nächstes? Gibt's Probleme? Diese Fragen stellen sich Programmierer gewissenhaft jeden Morgen. Allerdings ist das Problem natürlich übertragbar: wo es hingeht und was die Stolpersteine sind, das fragen sich auch Softwarearchitekten, Entscheider und Geldgeber, und nie war das Problem komplexer als in 2014. Kommen Sie zu dieser Keynote und werfen Sie mit Oliver Sturm einen Blick auf mögliche Antworten!","time_and_track":["\n     14.07.2014 09:15 - 10:00 Uhr "],"speaker":"Sturm, Oliver"},{"title":"Web Perfomance","description":"Performance im Web war noch nie so wichtig wie heute und es wird von Tag zu Tag schwieriger, eine schnelle Seite zu liefern. Jedoch gibt es einige Tricks - und damit ist nicht nur das übliche JS/CSS Minifying gemeint -, die die Ladezeiten der Webseite deutlich reduzieren können. In diesem Vortrag werden neue Lösungsansätze gezeigt, die nicht nur für den Desktop, sondern auch für mobile Geräte eine große Rolle spielen.","time_and_track":["\n     14.07.2014 10:30 - 11:30 Uhr    "," Webarchitekturen: Istanbul"],"speaker":"Bez, Roberto"},{"title":"Software-komponenten","description":"Was in anderen Industriezweigen schon seit Jahrzehnten gängige Praxis ist, wird in der Softwareentwicklung leider bis heute nur selten und wenn dann meist mangelhaft umgesetzt: Die Entwicklung von Systemen in Komponenten. Dabei ist die Lösung so simpel wie genial: Die Software wird in kleine Bausteine zerteilt, die keine harten Abhängigkeiten haben und dabei ohne Beschränkungen wiederverwendbar, testbar, austauschbar und skalierbar sind. David Tielke zeigt Ihnen in dieser Session wie solche Komponenten in objektorientierten Sprachen umgesetzt werden und zeigt in einer C#-Anwendung eine praktische Anwendung sowie einige Beispiele dieser Architekturform aus seinem Berateralltag.","time_and_track":["\n     14.07.2014 13:45 - 14:45 Uhr    "," Architektur: Tokio"],"speaker":"Tielke, David"},{"title":"Thementische","description":"In den vergangenen Jahren kamen auf Abendveranstaltungen unserer Konferenzen bei den Teilnehmern die Thementische sehr gut an. An diesen treffen sich Gleichgesinnte, um gemeinsam Problemlösungen zu finden oder dem „Experten des Tisches“ gezielte Fragen zu stellen. In zwei Schichten stehen die Experten am Montag, 14. Juli 2014 ab ca. 19.00 Uhr 1 Stunde lang den Teilnehmern mit Rat und Antworten zur Seite.","time_and_track":["\n     14.07.2014 19:00 - 21:30 Uhr "],"speaker":""},{"title":"Developer Week in Social Media","description":"","time_and_track":[""],"speaker":""},{"title":"Azure SQL: Was geht schon und was nicht?","description":"Ist die Entwicklung gegen Azure SQL vergleichbar mit der Entwicklung gegen die lokale Datenbank? Welche Vorteile und Nachteile gibt es bei der Arbeit im Team? Wie hoch sind die Kosten? Und was ist, wenn ich dann live gehen will?","time_and_track":["\n     15.07.2014 11:45 - 12:45 Uhr    "," Datenbanken/Datenzugriff: Istanbul"],"speaker":"Pichler, Bernhard"},{"title":"Move your NodeJS application to the Cloud","description":"NodeJS on Microsoft Azure: that's possible and natively supported. In this presentation, we will start by presenting what Microsoft Azure is and more specifically its main hosting and deployment capacities. Right after that, thanks to a live demo session, we will see how to make an existing application running on the Microsoft Azure Cloud and make it \"auto-scalable\". Azure Service Bus, Web Sites, NodeJS, socket.IO, deployment: no more theory, let's practice.","time_and_track":["\n     15.07.2014 13:45 - 14:45 Uhr    "," node.js: Sydney"],"speaker":"Escandell, Stephane"},{"title":"Eine Architektur für die Praxis","description":"Architekturen sind wichtig für den langfristigen Projekterfolg – das steht außer Frage. Aber was ist eine praxistaugliche Standardarchitektur die auch ohne dedizierten Softwarearchitekten umgesetzt werden kann? David Tielke zeigt Ihnen in dieser Session die Umsetzung einer skalierbaren Mehrschichtenarchitektur, die beliebig an Ihre Unternehmensanforderungen angepasst werden kann. Neben der theoretischen Betrachtung dieser Architekturform und der komponentenorientierten Softwareentwicklung, wird danach eine exemplarische Umsetzung auf Microsofts .NET Plattform gezeigt, welche allerdings auch auf andere objektorientierte Sprachen übertragbar ist.","time_and_track":["\n     15.07.2014 15:00 - 16:00 Uhr    "," Architekturpraxis: Tokio"],"speaker":"Tielke, David"},{"title":"Developer Week in Social Media","description":"","time_and_track":[""],"speaker":""},{"title":"Developer Week in Social Media","description":"","time_and_track":[""],"speaker":""},{"title":"Raspberry Pi JAM","description":"Den Abschluss der Maker Spaces, die Sie über den ganzen Konferenztag des 15.07.2014 willkommen heißen, bildet eine Raspberry Pi JAM. Diese findet von 19:30-21:00 statt. Folgende Themen stehen bereits fest, mehr können Sie bald erwarten:","time_and_track":["\n     15.07.2014 19:00 - 21:00 Uhr "],"speaker":"Ross, Marcus"},{"title":"Coding Dojo","description":"Im Rahmen der DWX Community Night bieten wir Ihnen auch ein Coding Dojo an: Nach kurzer Einführung einfach loscoden, oder Night Coding?","time_and_track":["\n     15.07.2014 20:00 - 23:00 Uhr "],"speaker":"Lösch, Hendrik"},{"title":"Pecha Kucha","description":"Pecha Kucha?","time_and_track":["\n     15.07.2014 19:00 - 20:00 Uhr "],"speaker":"Keil, Werner"},{"title":"Microsoft Gadget Garage","description":"Nach einem langen Konferenztag hat man sich nicht nur ein Bier am Abend verdient, sondern auch das Recht, sich spielerisch auszutoben. In der Microsoft Garage (Ebene 2, Raum Istanbul) können Sie bei einem Bierchen Ihre Fingerfertigkeit beim Sphero-Ball-Rennen und iRazer-Duell unter Beweis stellen. Entwickler gegen Entwickler, gesteuert durch Windows Phones. Auf alle Teilnehmer, Zuschauer und auch sonstige Interessenten warten Freibier, Give Aways, tolle Preise und jede Menge Spaß! Vorbeikommen lohnt sich.","time_and_track":["\n     15.07.2014 19:00 - 20:00 Uhr "],"speaker":"Meixner, Daniel"},{"title":"PowerPoint Karaoke","description":"Karaoke ist oftmals ein willkommenes Abend- und Wochenend-Programm und ist schon lange nicht nur in Japan, seinem Ursprungs-Land, bekannt und beliebt. Zur Instrumental-Version von bekannten Songs singen die Mitspieler mehr oder weniger schräg - hauptsache unterhaltsam.","time_and_track":["\n     15.07.2014 20:30 - 21:00 Uhr "],"speaker":""},{"title":"Zukunft entwickeln und technologisch zaubern - wie Hardware, Software und Cloud zusammenfinden","description":"„Jede hinreichend fortschrittliche Technologie ist von Magie nicht zu unterscheiden.\", meinte Arthur C. Clarke und schuf damit ein Mantra der Technologiegesellschaft. In diesem Vortrag werfen wir gemeinsam einen Blick auf die Bausteine mit denen wir heute schon ein wenig \"zaubern\" können und spannen einen Bogen über aktuelle Entwicklungen rund um Hardware, Software und Cloud.","time_and_track":["\n     16.07.2014 17:45 - 18:45 Uhr "],"speaker":"Primbs, Dirk"},{"title":"Developer Week in Social Media","description":"TheobaldLogo.eps 227,41 kB","time_and_track":[""],"speaker":""}]